app/admin/photos_admin.rb

    tab :photo do
      text_field :title
      text_area :description
      select :gallery_id, Gallery.all.map { |g| [g.title, g.id] }
---
SELECT "galleries".* FROM "galleries"