app/admin/services_admin.rb

SELECT COUNT(*) FROM "feedbacks" WHERE "feedbacks"."service_id" = ?  [["service_id", 1]]
---
      check_box :display_on_homepage, label: "Display on homepage"
    end

    tab :feedbacks, badge: service.feedbacks.count do