app/views/shared/_footer.html.erb

SELECT "contacts".* FROM "contacts"
---
              <%= @header_setting&.email %>
            <% elsif Contact.first.email %>