app/views/pages/home.html.erb

                    <p><%= event&.scholar %> | <span class="timing"><%= event&.start_time&.strftime("%I:%M %p") %></span></p>
                    <h4><i class="fas fa-tag"></i><span><%#= event&.event_types&.join(', ') %></span></h4>
---
SELECT "events".* FROM "events"