app/controllers/application_controller.rb

SELECT "header_settings".* FROM "header_settings" ORDER BY "header_settings"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def load_header_setting
    @header_setting = HeaderSetting.last