app/controllers/events_controller.rb

  def index
    @events = Event.where(active: true).order(created_at: :asc).page(params[:page])
---
SELECT "events".* FROM "events" WHERE "events"."active" = ? ORDER BY "events"."created_at" ASC LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 12], ["OFFSET", 0]]