app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.where(active: true).order(created_at: :asc).page(params[:page])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."active" = ? ORDER BY "galleries"."created_at" ASC LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 12], ["OFFSET", 0]]