app/controllers/pages_controller.rb

SELECT "sliders".* FROM "sliders"
SELECT "abouts".* FROM "abouts" ORDER BY "abouts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "events".* FROM "events"
SELECT "events".* FROM "events" ORDER BY "events"."date" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "services".* FROM "services"
SELECT "contacts".* FROM "contacts"
---
  def home
    @sliders = Slider.page(params[:slider_page]).per(10)
    @about = About.first
    @events = Event.page(params[:event_page]).per(10)
    @latest_event = Event.order(date: :asc).first
    @services = Service.on_homepage.page(params[:service_page]).per(10)
    @feedback = Feedback.new
    @contacts = Contact.all

SELECT "abouts".* FROM "abouts" ORDER BY "abouts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "contacts".* FROM "contacts"
---
  def about_us
    @about = About.first
    @feedback = Feedback.new
    @contacts = Contact.all