app/controllers/services_controller.rb

  def index
    @services = Service.where(active: true).order(created_at: :asc).page(params[:page])
---
SELECT "services".* FROM "services" WHERE "services"."active" = ? ORDER BY "services"."created_at" ASC LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 12], ["OFFSET", 0]]

  def show
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]