app/views/galleries/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."gallery_id" = ?  [["gallery_id", 1]]
---

  <% unless @gallery&.photos&.blank? %>

SELECT "photos".* FROM "photos" WHERE "photos"."gallery_id" = ?  [["gallery_id", 1]]
---
        <% image_count = 0 %>
        <% @gallery&.photos&.each do |gallery_photo| %>